In [3]:
# Import dependencies 
import pandas as pd
from matplotlib import pyplot as plt
import numpy as np
import scipy.stats as stats
import sqlalchemy
import psycopg2

from sqlalchemy import create_engine
from config import password
engine = create_engine(f"postgresql+psycopg2://postgres:{password}@localhost:5432/sql_homework")
conn = engine.connect()

In [10]:
# Import emp_no and emp_title_id from employees table
# employees = pd.read_sql('SELECT * FROM employees', conn)
employees = pd.read_sql('SELECT emp_no, emp_title_id FROM employees', conn)
employees.head()

   emp_no emp_title_id
0  473302        s0001
1  475053        e0002
2   57444        e0002
3  421786        s0001
4  282238        e0003

In [6]:
# Import salaries table
salaries = pd.read_sql('SELECT * FROM salaries', conn)
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [7]:
# Import titles table
titles = pd.read_sql('SELECT * FROM titles', conn)
titles.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [ ]:
# Merge employees and salaries tables

In [ ]:
# Create a histogram to visualize the most common salary ranges for employees.

In [ ]:
# Merge employees and salaries table with titles

In [ ]:
# Create a bar chart of average salary by title.